---
kind: other
id: Methods.T:Autodesk.Revit.DB.CurveByPointsUtils
source: html/de608628-553b-2997-5acf-ba805a9c1e76.htm
---
# CurveByPointsUtils Methods

Adds The CurveElements to one or more FaceRegions.